princeton/haproxy/results/2017-02-14.13.31.58.721048/httperf_client_129.log
httperf --verbose --hog --timeout=10 --client=0/1 --server=11.11.11.116 --port=8080 --uri=/ --rate=20 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 4096
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
             1.5 895
             2.5 60
             3.5 22
             4.5 13
             5.5 4
             6.5 3
             7.5 1
             :
             9.5 1
             :
            14.5 1

Total: connections 1000 requests 1000 replies 1000 test-duration 49.954 s

Connection rate: 20.0 conn/s (50.0 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.0 avg 1.6 max 14.2 median 1.5 stddev 0.8
Connection time [ms]: connect 0.3
Connection length [replies/conn]: 1.000

Request rate: 20.0 req/s (50.0 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 20.0 avg 20.0 max 20.0 stddev 0.0 (49 samples)
Percentages of the replies served at a given rate:
   50%: 19
   66%: 19
   75%: 19
   80%: 19
   90%: 19
   95%: 19
   98%: 20
   99%: 20
  100%: 20

Reply time [ms]: response 1.2 transfer 0.1
Percentages of the requests served within a certain time (ms) :
   50%: 1
   66%: 1
   75%: 1
   80%: 1
   90%: 1
   95%: 1
   98%: 2
   99%: 3
  100%: 9

Reply size [B]: header 254.0 content 11510.0 footer 0.0 (total 11764.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 33.67 system 16.28 (user 67.4% system 32.6% total 100.0%)
Net I/O: 231.2 KB/s (1.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --verbose --hog --timeout=10 --client=0/1 --server=11.11.11.116 --port=8080 --uri=/ --rate=30 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 4096
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
             1.5 900
             2.5 35
             3.5 30
             4.5 20
             5.5 9
             6.5 3
             7.5 2
             :
            11.5 1

Total: connections 1000 requests 1000 replies 1000 test-duration 33.301 s

Connection rate: 30.0 conn/s (33.3 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.0 avg 1.6 max 12.0 median 1.5 stddev 0.9
Connection time [ms]: connect 0.3
Connection length [replies/conn]: 1.000

Request rate: 30.0 req/s (33.3 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 30.0 avg 30.0 max 30.0 stddev 0.0 (33 samples)
Percentages of the replies served at a given rate:
   50%: 29
   66%: 29
   75%: 29
   80%: 29
   90%: 29
   95%: 29
   98%: 30
   99%: 30
  100%: 30

Reply time [ms]: response 1.1 transfer 0.1
Percentages of the requests served within a certain time (ms) :
   50%: 1
   66%: 1
   75%: 1
   80%: 1
   90%: 1
   95%: 1
   98%: 3
   99%: 4
  100%: 10

Reply size [B]: header 254.0 content 11510.0 footer 0.0 (total 11764.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 22.12 system 11.17 (user 66.4% system 33.5% total 100.0%)
Net I/O: 346.9 KB/s (2.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --verbose --hog --timeout=10 --client=0/1 --server=11.11.11.116 --port=8080 --uri=/ --rate=40 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 4096
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             0.5 1
             1.5 862
             2.5 76
             3.5 27
             4.5 13
             5.5 8
             6.5 6
             7.5 4
             8.5 1
             9.5 1
             :
            13.5 1

Total: connections 1000 requests 1000 replies 1000 test-duration 24.977 s

Connection rate: 40.0 conn/s (25.0 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.0 avg 1.7 max 13.2 median 1.5 stddev 1.0
Connection time [ms]: connect 0.4
Connection length [replies/conn]: 1.000

Request rate: 40.0 req/s (25.0 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 40.0 avg 40.0 max 40.0 stddev 0.0 (24 samples)
Percentages of the replies served at a given rate:
   50%: 39
   66%: 39
   75%: 39
   80%: 39
   90%: 39
   95%: 39
   98%: 39
   99%: 39
  100%: 40

Reply time [ms]: response 1.2 transfer 0.1
Percentages of the requests served within a certain time (ms) :
   50%: 1
   66%: 1
   75%: 1
   80%: 1
   90%: 1
   95%: 2
   98%: 3
   99%: 3
  100%: 7

Reply size [B]: header 254.0 content 11510.0 footer 0.0 (total 11764.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 16.79 system 8.19 (user 67.2% system 32.8% total 100.0%)
Net I/O: 462.5 KB/s (3.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --verbose --hog --timeout=10 --client=0/1 --server=11.11.11.116 --port=8080 --uri=/ --rate=50 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 4096
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
             1.5 840
             2.5 90
             3.5 28
             4.5 17
             5.5 14
             6.5 5
             7.5 3
             8.5 3

Total: connections 1000 requests 1000 replies 1000 test-duration 19.981 s

Connection rate: 50.0 conn/s (20.0 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.1 avg 1.8 max 8.7 median 1.5 stddev 0.9
Connection time [ms]: connect 0.3
Connection length [replies/conn]: 1.000

Request rate: 50.0 req/s (20.0 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 50.0 avg 50.0 max 50.0 stddev 0.0 (19 samples)
Percentages of the replies served at a given rate:
   50%: 49
   66%: 49
   75%: 49
   80%: 49
   90%: 49
   95%: 49
   98%: 49
   99%: 49
  100%: 50

Reply time [ms]: response 1.4 transfer 0.2
Percentages of the requests served within a certain time (ms) :
   50%: 1
   66%: 1
   75%: 1
   80%: 1
   90%: 1
   95%: 2
   98%: 4
   99%: 5
  100%: 8

Reply size [B]: header 254.0 content 11510.0 footer 0.0 (total 11764.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 12.81 system 7.17 (user 64.1% system 35.9% total 100.0%)
Net I/O: 578.1 KB/s (4.7*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --verbose --hog --timeout=10 --client=0/1 --server=11.11.11.116 --port=8080 --uri=/ --rate=60 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 4096
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             0.5 1
             1.5 879
             2.5 48
             3.5 30
             4.5 22
             5.5 7
             6.5 5
             7.5 5
             8.5 1
             9.5 1
            10.5 1

Total: connections 1000 requests 1000 replies 1000 test-duration 16.651 s

Connection rate: 60.1 conn/s (16.7 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.0 avg 1.6 max 10.7 median 1.5 stddev 1.0
Connection time [ms]: connect 0.3
Connection length [replies/conn]: 1.000

Request rate: 60.1 req/s (16.7 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 60.0 avg 60.0 max 60.0 stddev 0.0 (16 samples)
Percentages of the replies served at a given rate:
   50%: 59
   66%: 59
   75%: 59
   80%: 59
   90%: 59
   95%: 60
   98%: 60
   99%: 60
  100%: 60

Reply time [ms]: response 1.1 transfer 0.1
Percentages of the requests served within a certain time (ms) :
   50%: 1
   66%: 1
   75%: 1
   80%: 1
   90%: 1
   95%: 2
   98%: 3
   99%: 4
  100%: 9

Reply size [B]: header 254.0 content 11510.0 footer 0.0 (total 11764.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 11.14 system 5.50 (user 66.9% system 33.1% total 100.0%)
Net I/O: 693.8 KB/s (5.7*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --verbose --hog --timeout=10 --client=0/1 --server=11.11.11.116 --port=8080 --uri=/ --rate=70 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 4096
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
             1.5 493
             2.5 320
             3.5 74
             4.5 44
             5.5 33
             6.5 10
             7.5 11
             8.5 3
             9.5 4
            10.5 2
            11.5 3
             :
            13.5 1
             :
            15.5 2

Total: connections 1000 requests 1000 replies 1000 test-duration 14.275 s

Connection rate: 70.1 conn/s (14.3 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 1.1 avg 2.6 max 15.7 median 2.5 stddev 1.6
Connection time [ms]: connect 0.3
Connection length [replies/conn]: 1.000

Request rate: 70.1 req/s (14.3 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 70.0 avg 70.0 max 70.0 stddev 0.0 (14 samples)
Percentages of the replies served at a given rate:
   50%: 69
   66%: 69
   75%: 69
   80%: 69
   90%: 69
   95%: 69
   98%: 69
   99%: 69
  100%: 70

Reply time [ms]: response 1.8 transfer 0.4
Percentages of the requests served within a certain time (ms) :
   50%: 1
   66%: 1
   75%: 1
   80%: 1
   90%: 3
   95%: 4
   98%: 5
   99%: 7
  100%: 15

Reply size [B]: header 254.0 content 11510.0 footer 0.0 (total 11764.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 9.33 system 4.95 (user 65.3% system 34.7% total 100.0%)
Net I/O: 809.2 KB/s (6.6*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --verbose --hog --timeout=10 --client=0/1 --server=11.11.11.116 --port=8080 --uri=/ --rate=80 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 4096
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
             1.5 641
             2.5 204
             3.5 57
             4.5 40
             5.5 18
             6.5 8
             7.5 11
             8.5 10
             9.5 4
            10.5 3
            11.5 2
            12.5 1
            13.5 1

Total: connections 1000 requests 1000 replies 1000 test-duration 12.490 s

Connection rate: 80.1 conn/s (12.5 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 1.0 avg 2.3 max 13.5 median 1.5 stddev 1.5
Connection time [ms]: connect 0.4
Connection length [replies/conn]: 1.000

Request rate: 80.1 req/s (12.5 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 80.0 avg 80.0 max 80.0 stddev 0.0 (12 samples)
Percentages of the replies served at a given rate:
   50%: 79
   66%: 79
   75%: 79
   80%: 79
   90%: 79
   95%: 79
   98%: 79
   99%: 79
  100%: 80

Reply time [ms]: response 1.6 transfer 0.2
Percentages of the requests served within a certain time (ms) :
   50%: 1
   66%: 1
   75%: 1
   80%: 1
   90%: 2
   95%: 3
   98%: 6
   99%: 7
  100%: 12

Reply size [B]: header 254.0 content 11510.0 footer 0.0 (total 11764.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 7.98 system 4.51 (user 63.9% system 36.1% total 100.0%)
Net I/O: 924.9 KB/s (7.6*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --verbose --hog --timeout=10 --client=0/1 --server=11.11.11.116 --port=8080 --uri=/ --rate=90 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 4096
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
             1.5 720
             2.5 114
             3.5 52
             4.5 26
             5.5 25
             6.5 20
             7.5 10
             8.5 12
             9.5 6
            10.5 3
            11.5 5
            12.5 1
            13.5 1
            14.5 1
            15.5 1
             :
            17.5 1
             :
            19.5 1
             :
            21.5 1

Total: connections 1000 requests 1000 replies 1000 test-duration 11.101 s

Connection rate: 90.1 conn/s (11.1 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 1.1 avg 2.4 max 21.3 median 1.5 stddev 2.1
Connection time [ms]: connect 0.4
Connection length [replies/conn]: 1.000

Request rate: 90.1 req/s (11.1 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 88.9 avg 90.1 max 91.0 stddev 0.6 (11 samples)
Percentages of the replies served at a given rate:
   50%: 89
   66%: 89
   75%: 90
   80%: 90
   90%: 90
   95%: 90
   98%: 90
   99%: 90
  100%: 91

Reply time [ms]: response 1.6 transfer 0.3
Percentages of the requests served within a certain time (ms) :
   50%: 1
   66%: 1
   75%: 1
   80%: 1
   90%: 2
   95%: 4
   98%: 7
   99%: 8
  100%: 18

Reply size [B]: header 254.0 content 11510.0 footer 0.0 (total 11764.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 7.31 system 3.79 (user 65.9% system 34.1% total 100.0%)
Net I/O: 1040.6 KB/s (8.5*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --verbose --hog --timeout=10 --client=0/1 --server=11.11.11.116 --port=8080 --uri=/ --rate=100 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 4096
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
             1.5 542
             2.5 231
             3.5 68
             4.5 48
             5.5 36
             6.5 21
             7.5 15
             8.5 8
             9.5 4
            10.5 6
            11.5 4
            12.5 3
            13.5 5
            14.5 4
            15.5 1
             :
            17.5 1
            18.5 1
             :
            21.5 1
            22.5 1

Total: connections 1000 requests 1000 replies 1000 test-duration 9.991 s

Connection rate: 100.1 conn/s (10.0 ms/conn, <=3 concurrent connections)
Connection time [ms]: min 1.1 avg 2.8 max 22.8 median 1.5 stddev 2.4
Connection time [ms]: connect 0.6
Connection length [replies/conn]: 1.000

Request rate: 100.1 req/s (10.0 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 100.0 avg 100.0 max 100.0 stddev 0.0 (9 samples)
Percentages of the replies served at a given rate:
   50%: 99
   66%: 99
   75%: 99
   80%: 99
   90%: 99
   95%: 99
   98%: 99
   99%: 99
  100%: 100

Reply time [ms]: response 1.9 transfer 0.3
Percentages of the requests served within a certain time (ms) :
   50%: 1
   66%: 1
   75%: 1
   80%: 2
   90%: 3
   95%: 4
   98%: 7
   99%: 9
  100%: 18

Reply size [B]: header 254.0 content 11510.0 footer 0.0 (total 11764.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 6.47 system 3.52 (user 64.7% system 35.3% total 100.0%)
Net I/O: 1156.2 KB/s (9.5*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --verbose --hog --timeout=10 --client=0/1 --server=11.11.11.116 --port=8080 --uri=/ --rate=110 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 4096
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
             1.5 617
             2.5 171
             3.5 63
             4.5 51
             5.5 25
             6.5 15
             7.5 20
             8.5 14
             9.5 4
            10.5 6
            11.5 4
            12.5 1
            13.5 6
             :
            15.5 1
             :
            17.5 1
             :
            21.5 1

Total: connections 1000 requests 1000 replies 1000 test-duration 9.084 s

Connection rate: 110.1 conn/s (9.1 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 1.1 avg 2.6 max 21.2 median 1.5 stddev 2.2
Connection time [ms]: connect 0.5
Connection length [replies/conn]: 1.000

Request rate: 110.1 req/s (9.1 ms/req)
Request size [B]: 65.0

Reply rate [replies/s]: min 109.0 avg 109.9 max 110.0 stddev 0.3 (9 samples)
Percentages of the replies served at a given rate:
   50%: 109
   66%: 109
   75%: 109
   80%: 109
   90%: 109
   95%: 109
   98%: 109
   99%: 109
  100%: 110

Reply time [ms]: response 1.8 transfer 0.3
Percentages of the requests served within a certain time (ms) :
   50%: 1
   66%: 1
   75%: 1
   80%: 1
   90%: 3
   95%: 4
   98%: 7
   99%: 8
  100%: 15

Reply size [B]: header 254.0 content 11510.0 footer 0.0 (total 11764.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 5.85 system 3.24 (user 64.4% system 35.6% total 100.0%)
Net I/O: 1271.6 KB/s (10.4*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0